       01 OFCRM-REGISTER.
         05 OFCRM-KEY.
           10 OFCRM-ID         PIC X(04).
         05 OFCRM-NAME       PIC X(25).
         05 OFCRM-EMAIL      PIC X(30).
         05 OFCRM-PHONE      PIC X(14).
         05 OFCRM-STATUS     PIC 9(01).
