       01 WS-CRM-REGISTER.
         05 WS-CRM-ID         PIC X(04).
         05 WS-CRM-NAME       PIC X(25).
         05 WS-CRM-EMAIL      PIC X(30).
         05 WS-CRM-PHONE      PIC X(14).
         05 WS-CRM-STATUS     PIC 9(01).
